import React from "react";
import '../pagesCss/About.css'
import Footer from "./Option/Footer";

function About(){
    return (
        <div>
            <div className="tabHead"></div>
            <section className="nav2">
                <div className="links2">
                    <ul className="aboutul">
                        <a href="/"><li className="aboutlink">หน้าแรก</li></a>
                        <a href="/about"><li className="aboutlink">เกี่ยวกับ</li></a>
                        <a href="/1StopService"><li className="aboutlink">E-Service</li></a>
                        <a href="/News"><li className="aboutlink">ข่าวประชาสัมพันธ์</li></a>
                        <a href="/ContactUs"><li className="aboutlink">ติดต่อ</li></a>
                    </ul>
                </div>
            </section>

            <div className="text-about">
                <h1 style={{marginBottom: '2vh'}}>ความเป็นมา</h1>
                <p>&nbsp;&nbsp;&nbsp;&nbsp;เนื่องจากยุคปัจจุบันวัฒนธรรมทางด้านดนตรีนั้นมีความนิยมอย่างแพร่หลายไม่ว่าจะในแง่ การเล่นเพื่อสังสรรค์ ผ่อนคลาย จนไปถึงการยึดถือเป็นอาชีพเพื่อดำรงคชีพและนอกเหนือจากนั้นยังมีการ
                กิจกรรมทางดนตรีอีกมากมาย ซึ่งไม่สามารถปฏิเสธได้ว่าเทศกาลดนตรีนั้นอยู่คู่กับสังคมมาหลายยุคหลายสมัย ตั้งแต่ที่เทคโนโลยียังไม่ได้มีส่วนร่วม 
                จนถึงในช่วงยุคปัจจุบันที่เทคโนโลยีกลายเป็นตัวเลือกหลักของการซื้อหรือจองตั๋วเพื่อเข้าไปร่วมงานนั้นๆ แต่หาก
                มองลงให้ลึกลงไป เราจะพบปัญหามากมาย เช่น ระบบจองตั๋วที่พร้อมจะล่มหรือระบบค้างทันทีที่มี
                ผู้ใช้งานจำนวนมาก ส่งผลให้หลายคนไม่ได้รับบัตรหรือแม้กระทั่งกลุ่มคนที่เห็นเป็นธรุกิจโดยใช้บอท 
                ทำการกดซื้อตั๋วแล้วนำไปขายต่อในราคาที่แพงกว่าราคาที่ควรจะเป็นซึ่งจากการกระทำดังกล่าวนั้น ได้ส่งผลให้เกิดการส่งข้อมูลจำนวนมากภายในระบบ
                จากปัญหาที่กล่าวมาข้างต้น ทางผู้จัดทำได้เล็งเห็นในส่วนนั้นจึงได้มีความคิดที่ริเริ่มจะปรับปรุง
                และเพิ่มประสิทธิภาพในการทำงานของระบบดังกล่าว โดยในโครงงานนี้จะทำการสร้างระบบโดยเน้นใน
                ส่วนของการทำฐานข้อมูลรวมถึงการสร้างความเข้าใจ ในการจัดการข้อมูลในฐานข้อมูลในระบบมากยิ่งขึ้น</p><br /><br />

                <h2>Data 1</h2>
                <p>&nbsp;&nbsp;&nbsp;&nbsp;เนื่องจากยุคปัจจุบันวัฒนธรรมทางด้านดนตรีนั้นมีความนิยมอย่างแพร่หลายไม่ว่าจะในแง่ การเล่นเพื่อสังสรรค์ ผ่อนคลาย จนไปถึงการยึดถือเป็นอาชีพเพื่อดำรงคชีพและนอกเหนือจากนั้นยังมีการ
                กิจกรรมทางดนตรีอีกมากมาย ซึ่งไม่สามารถปฏิเสธได้ว่าเทศกาลดนตรีนั้นอยู่คู่กับสังคมมาหลายยุคหลายสมัย ตั้งแต่ที่เทคโนโลยียังไม่ได้มีส่วนร่วม 
                จนถึงในช่วงยุคปัจจุบันที่เทคโนโลยีกลายเป็นตัวเลือกหลักของการซื้อหรือจองตั๋วเพื่อเข้าไปร่วมงานนั้นๆ แต่หาก
                มองลงให้ลึกลงไป เราจะพบปัญหามากมาย เช่น ระบบจองตั๋วที่พร้อมจะล่มหรือระบบค้างทันทีที่มี
                ผู้ใช้งานจำนวนมาก ส่งผลให้หลายคนไม่ได้รับบัตรหรือแม้กระทั่งกลุ่มคนที่เห็นเป็นธรุกิจโดยใช้บอท 
                ทำการกดซื้อตั๋วแล้วนำไปขายต่อในราคาที่แพงกว่าราคาที่ควรจะเป็นซึ่งจากการกระทำดังกล่าวนั้น ได้ส่งผลให้เกิดการส่งข้อมูลจำนวนมากภายในระบบ
                จากปัญหาที่กล่าวมาข้างต้น ทางผู้จัดทำได้เล็งเห็นในส่วนนั้นจึงได้มีความคิดที่ริเริ่มจะปรับปรุง
                และเพิ่มประสิทธิภาพในการทำงานของระบบดังกล่าว โดยในโครงงานนี้จะทำการสร้างระบบโดยเน้นใน
                ส่วนของการทำฐานข้อมูลรวมถึงการสร้างความเข้าใจ ในการจัดการข้อมูลในฐานข้อมูลในระบบมากยิ่งขึ้น</p><br /><br />

                    <h2>Data 2</h2>
                <p>&nbsp;&nbsp;&nbsp;&nbsp;เนื่องจากยุคปัจจุบันวัฒนธรรมทางด้านดนตรีนั้นมีความนิยมอย่างแพร่หลายไม่ว่าจะในแง่ การเล่นเพื่อสังสรรค์ ผ่อนคลาย จนไปถึงการยึดถือเป็นอาชีพเพื่อดำรงคชีพและนอกเหนือจากนั้นยังมีการ
                กิจกรรมทางดนตรีอีกมากมาย ซึ่งไม่สามารถปฏิเสธได้ว่าเทศกาลดนตรีนั้นอยู่คู่กับสังคมมาหลายยุคหลายสมัย ตั้งแต่ที่เทคโนโลยียังไม่ได้มีส่วนร่วม 
                จนถึงในช่วงยุคปัจจุบันที่เทคโนโลยีกลายเป็นตัวเลือกหลักของการซื้อหรือจองตั๋วเพื่อเข้าไปร่วมงานนั้นๆ แต่หาก
                มองลงให้ลึกลงไป เราจะพบปัญหามากมาย เช่น ระบบจองตั๋วที่พร้อมจะล่มหรือระบบค้างทันทีที่มี
                ผู้ใช้งานจำนวนมาก ส่งผลให้หลายคนไม่ได้รับบัตรหรือแม้กระทั่งกลุ่มคนที่เห็นเป็นธรุกิจโดยใช้บอท 
                ทำการกดซื้อตั๋วแล้วนำไปขายต่อในราคาที่แพงกว่าราคาที่ควรจะเป็นซึ่งจากการกระทำดังกล่าวนั้น ได้ส่งผลให้เกิดการส่งข้อมูลจำนวนมากภายในระบบ
                จากปัญหาที่กล่าวมาข้างต้น ทางผู้จัดทำได้เล็งเห็นในส่วนนั้นจึงได้มีความคิดที่ริเริ่มจะปรับปรุง
                และเพิ่มประสิทธิภาพในการทำงานของระบบดังกล่าว โดยในโครงงานนี้จะทำการสร้างระบบโดยเน้นใน
                ส่วนของการทำฐานข้อมูลรวมถึงการสร้างความเข้าใจ ในการจัดการข้อมูลในฐานข้อมูลในระบบมากยิ่งขึ้น</p><br /><br />

                    <h2>Data 3</h2>
                <p>&nbsp;&nbsp;&nbsp;&nbsp;เนื่องจากยุคปัจจุบันวัฒนธรรมทางด้านดนตรีนั้นมีความนิยมอย่างแพร่หลายไม่ว่าจะในแง่ การเล่นเพื่อสังสรรค์ ผ่อนคลาย จนไปถึงการยึดถือเป็นอาชีพเพื่อดำรงคชีพและนอกเหนือจากนั้นยังมีการ
                กิจกรรมทางดนตรีอีกมากมาย ซึ่งไม่สามารถปฏิเสธได้ว่าเทศกาลดนตรีนั้นอยู่คู่กับสังคมมาหลายยุคหลายสมัย ตั้งแต่ที่เทคโนโลยียังไม่ได้มีส่วนร่วม 
                จนถึงในช่วงยุคปัจจุบันที่เทคโนโลยีกลายเป็นตัวเลือกหลักของการซื้อหรือจองตั๋วเพื่อเข้าไปร่วมงานนั้นๆ แต่หาก
                มองลงให้ลึกลงไป เราจะพบปัญหามากมาย เช่น ระบบจองตั๋วที่พร้อมจะล่มหรือระบบค้างทันทีที่มี
                ผู้ใช้งานจำนวนมาก ส่งผลให้หลายคนไม่ได้รับบัตรหรือแม้กระทั่งกลุ่มคนที่เห็นเป็นธรุกิจโดยใช้บอท 
                ทำการกดซื้อตั๋วแล้วนำไปขายต่อในราคาที่แพงกว่าราคาที่ควรจะเป็นซึ่งจากการกระทำดังกล่าวนั้น ได้ส่งผลให้เกิดการส่งข้อมูลจำนวนมากภายในระบบ
                จากปัญหาที่กล่าวมาข้างต้น ทางผู้จัดทำได้เล็งเห็นในส่วนนั้นจึงได้มีความคิดที่ริเริ่มจะปรับปรุง
                และเพิ่มประสิทธิภาพในการทำงานของระบบดังกล่าว โดยในโครงงานนี้จะทำการสร้างระบบโดยเน้นใน
                ส่วนของการทำฐานข้อมูลรวมถึงการสร้างความเข้าใจ ในการจัดการข้อมูลในฐานข้อมูลในระบบมากยิ่งขึ้น
                เนื่องจากยุคปัจจุบันวัฒนธรรมทางด้านดนตรีนั้นมีความนิยมอย่างแพร่หลายไม่ว่าจะในแง่ การเล่นเพื่อสังสรรค์ ผ่อนคลาย จนไปถึงการยึดถือเป็นอาชีพเพื่อดำรงคชีพและนอกเหนือจากนั้นยังมีการ
                กิจกรรมทางดนตรีอีกมากมาย ซึ่งไม่สามารถปฏิเสธได้ว่าเทศกาลดนตรีนั้นอยู่คู่กับสังคมมาหลายยุคหลายสมัย ตั้งแต่ที่เทคโนโลยียังไม่ได้มีส่วนร่วม 
                จนถึงในช่วงยุคปัจจุบันที่เทคโนโลยีกลายเป็นตัวเลือกหลักของการซื้อหรือจองตั๋วเพื่อเข้าไปร่วมงานนั้นๆ แต่หาก
                มองลงให้ลึกลงไป เราจะพบปัญหามากมาย เช่น ระบบจองตั๋วที่พร้อมจะล่มหรือระบบค้างทันทีที่มี
                ผู้ใช้งานจำนวนมาก ส่งผลให้หลายคนไม่ได้รับบัตรหรือแม้กระทั่งกลุ่มคนที่เห็นเป็นธรุกิจโดยใช้บอท 
                ทำการกดซื้อตั๋วแล้วนำไปขายต่อในราคาที่แพงกว่าราคาที่ควรจะเป็นซึ่งจากการกระทำดังกล่าวนั้น ได้ส่งผลให้เกิดการส่งข้อมูลจำนวนมากภายในระบบ
                จากปัญหาที่กล่าวมาข้างต้น ทางผู้จัดทำได้เล็งเห็นในส่วนนั้นจึงได้มีความคิดที่ริเริ่มจะปรับปรุง
                และเพิ่มประสิทธิภาพในการทำงานของระบบดังกล่าว โดยในโครงงานนี้จะทำการสร้างระบบโดยเน้นใน
                ส่วนของการทำฐานข้อมูลรวมถึงการสร้างความเข้าใจ ในการจัดการข้อมูลในฐานข้อมูลในระบบมากยิ่งขึ้น</p><br /><br />

                    <h2>Data 4</h2>
                <p>&nbsp;&nbsp;&nbsp;&nbsp;เนื่องจากยุคปัจจุบันวัฒนธรรมทางด้านดนตรีนั้นมีความนิยมอย่างแพร่หลายไม่ว่าจะในแง่ การเล่นเพื่อสังสรรค์ ผ่อนคลาย จนไปถึงการยึดถือเป็นอาชีพเพื่อดำรงคชีพและนอกเหนือจากนั้นยังมีการ
                กิจกรรมทางดนตรีอีกมากมาย ซึ่งไม่สามารถปฏิเสธได้ว่าเทศกาลดนตรีนั้นอยู่คู่กับสังคมมาหลายยุคหลายสมัย ตั้งแต่ที่เทคโนโลยียังไม่ได้มีส่วนร่วม 
                จนถึงในช่วงยุคปัจจุบันที่เทคโนโลยีกลายเป็นตัวเลือกหลักของการซื้อหรือจองตั๋วเพื่อเข้าไปร่วมงานนั้นๆ แต่หาก
                มองลงให้ลึกลงไป เราจะพบปัญหามากมาย เช่น ระบบจองตั๋วที่พร้อมจะล่มหรือระบบค้างทันทีที่มี
                ผู้ใช้งานจำนวนมาก ส่งผลให้หลายคนไม่ได้รับบัตรหรือแม้กระทั่งกลุ่มคนที่เห็นเป็นธรุกิจโดยใช้บอท 
                ทำการกดซื้อตั๋วแล้วนำไปขายต่อในราคาที่แพงกว่าราคาที่ควรจะเป็นซึ่งจากการกระทำดังกล่าวนั้น ได้ส่งผลให้เกิดการส่งข้อมูลจำนวนมากภายในระบบ
                จากปัญหาที่กล่าวมาข้างต้น ทางผู้จัดทำได้เล็งเห็นในส่วนนั้นจึงได้มีความคิดที่ริเริ่มจะปรับปรุง
                และเพิ่มประสิทธิภาพในการทำงานของระบบดังกล่าว โดยในโครงงานนี้จะทำการสร้างระบบโดยเน้นใน
                ส่วนของการทำฐานข้อมูลรวมถึงการสร้างความเข้าใจ ในการจัดการข้อมูลในฐานข้อมูลในระบบมากยิ่งขึ้น</p><br /><br />
            </div>
            <div style={{marginBottom: '10vh'}}></div>
            <Footer/>
        </div>
    );
}
export default About